api/app/controllers/v1/charities_controller.rb

  def index
    @charities = Charity.all
---
SELECT "charities".* FROM "charities"

  def create
    @charity = Charity.new( charity_params )

    @charity.save
---
INSERT INTO "charities" ("charity_name", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["charity_name", "StreetChange"], ["password", "123"], ["created_at", "2017-09-19 10:27:36.557398"], ["updated_at", "2017-09-19 10:27:36.557398"]]

  def destroy
    @charity = Charity.where( id: params[:id] ).first
    if @charity.destroy
---
SELECT  "charities".* FROM "charities" WHERE "charities"."id" = $1 ORDER BY "charities"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "charities" WHERE "charities"."id" = $1  [["id", 2]]