api/app/controllers/v1/donations_controller.rb

  def index
    @donations = Donation.all
---
SELECT "donations".* FROM "donations"

  def create
    @donation = Donation.new( donation_params )

    @donation.save
---
INSERT INTO "donations" ("donation_from", "donation_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["donation_from", "Reece"], ["donation_amount", "500.0"], ["created_at", "2017-09-19 21:17:28.038103"], ["updated_at", "2017-09-19 21:17:28.038103"]]