api/app/controllers/v1/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Johnny"], ["last_name", "Watson"], ["password", "123"], ["created_at", "2017-09-19 10:30:20.310755"], ["updated_at", "2017-09-19 10:30:20.310755"]]
---
  def create
    @user = User.new( user_params )

    @user.save